In [3]:
import pandas as pd
pd.__version__

'1.2.4'

In [4]:
df = pd.read_csv("https://raw.githubusercontent.com/ingledarshan/BoardInfinity/main/student_records.csv")
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [5]:
df1 = pd.DataFrame({
    'employee' : ['Bob','Jake','Lisa','Sue'],
    'group' : ['Accounting','Engineering','Engineering','HR']
})
df2 = pd.DataFrame({
    'employee' : ['Lisa','Bob','Jake','Sue'],
    'hire_date' : [2004,2008,2012,2014]
})
print(df1)
print()
print(df2)
df3 = pd.merge(df1,df2)
df3

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [6]:
df6 = pd.DataFrame({
    'name' : ['Peter','Paul','Mary'],
    'food' : ['fish','beans','bread']
})
df7 = pd.DataFrame({
    'name' : ['Mary','Joseph'],
    'drink' : ['wine','beer']
})
print(df6)
print()
print(df7)
pd.merge(df6,df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

   name   food drink
0  Mary  bread  wine

In [7]:
print(df6)
print()
print(df7)
pd.merge(df6,df7, how='outer')

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer